Revit 2027 API
UpdaterRegistry.RemoveAllTriggers Method
 Removes all triggers associated with Updater with specified UpdaterId. Does not unregister updater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void RemoveAllTriggers(
	UpdaterId id
)
Public Shared Sub RemoveAllTriggers (
	id As UpdaterId
)
public:
static void RemoveAllTriggers(
	UpdaterId^ id
)
static member RemoveAllTriggers :
        id : UpdaterId -> unit
Parameters
id UpdaterId
 Id of specified updater
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The updater's owner's AddIn does not match the currently active AddIn. -or- RemoveAllTriggers called while executing an updater.
See Also
Reference
UpdaterRegistry Class
Autodesk.Revit.DB Namespace